-- MySQL dump 10.13  Distrib 8.0.33, for Win64 (x86_64)
--
-- Host: database-ssafywiki.cnbro2eo1odc.ap-northeast-2.rds.amazonaws.com    Database: ssafywiki
-- ------------------------------------------------------
-- Server version	8.0.33

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ '';

--
-- Table structure for table `documents`
--

DROP TABLE IF EXISTS `documents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `documents` (
  `docs_id` bigint NOT NULL AUTO_INCREMENT,
  `docs_created_at` timestamp NULL DEFAULT NULL,
  `docs_is_deleted` bit(1) DEFAULT NULL,
  `docs_modified_at` timestamp NULL DEFAULT NULL,
  `docs_read_auth` bigint DEFAULT NULL,
  `docs_is_redirect` bit(1) DEFAULT NULL,
  `docs_title` varchar(255) DEFAULT NULL,
  `docs_write_auth` bigint DEFAULT NULL,
  `docs_parent_id` bigint DEFAULT NULL,
  `docs_user_id` bigint DEFAULT NULL,
  PRIMARY KEY (`docs_id`),
  KEY `FK6xbwrleeb1gfohtg545kga5td` (`docs_parent_id`),
  KEY `FKe4cwtafofuy43svrxc8vpault` (`docs_user_id`),
  CONSTRAINT `FK6xbwrleeb1gfohtg545kga5td` FOREIGN KEY (`docs_parent_id`) REFERENCES `documents` (`docs_id`),
  CONSTRAINT `FKe4cwtafofuy43svrxc8vpault` FOREIGN KEY (`docs_user_id`) REFERENCES `users` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=105 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `documents`
--

LOCK TABLES `documents` WRITE;
/*!40000 ALTER TABLE `documents` DISABLE KEYS */;
INSERT INTO `documents` VALUES (1,'2023-11-09 15:02:59',_binary '\0','2023-11-17 01:23:42',1,_binary '\0','싸피위키:대문',3,NULL,30),(2,'2023-11-09 15:20:22',_binary '\0','2023-11-14 16:39:34',1,_binary '\0','삼성 청년 SW 아카데미',1000,NULL,24),(3,'2023-11-09 23:50:57',_binary '\0','2023-11-13 12:06:31',1,_binary '','싸피위키',2,NULL,24),(4,'2023-11-10 09:45:55',_binary '\0','2023-11-10 09:45:55',1,_binary '','대문',2,NULL,36),(5,'2023-11-10 14:10:38',_binary '','2023-11-13 11:11:42',1,_binary '\0','권선근',2,NULL,30),(6,'2023-11-12 22:12:26',_binary '','2023-11-13 16:43:05',1,_binary '\0','x10',2,NULL,30),(7,'2023-11-12 22:13:11',_binary '','2023-11-13 11:26:24',1,_binary '\0','x9',2,NULL,30),(8,'2023-11-13 09:54:51',_binary '','2023-11-13 11:11:43',1,_binary '\0','x8',2,NULL,45),(9,'2023-11-13 10:12:55',_binary '\0','2023-11-15 15:49:53',1,_binary '\0','최영은 (0953864)',2,NULL,39),(10,'2023-11-13 10:14:27',_binary '','2023-11-13 10:45:39',1,_binary '\0','x1',2,NULL,45),(11,'2023-11-13 10:14:32',_binary '','2023-11-13 11:11:41',1,_binary '\0','x0',2,NULL,45),(12,'2023-11-13 10:14:32',_binary '','2023-11-13 10:45:39',1,_binary '\0','x2',2,NULL,45),(13,'2023-11-13 10:18:20',_binary '\0','2023-11-14 17:51:55',2,_binary '\0','부울경캠',2,NULL,38),(14,'2023-11-13 10:18:21',_binary '','2023-11-13 10:44:55',1,_binary '\0','x3',2,NULL,47),(15,'2023-11-13 10:18:21',_binary '','2023-11-13 10:44:54',1,_binary '\0','x4',2,NULL,47),(16,'2023-11-13 10:27:47',_binary '','2023-11-13 10:44:52',1,_binary '\0','x5',2,NULL,49),(17,'2023-11-13 10:29:19',_binary '','2023-11-13 10:44:53',1,_binary '\0','x6',2,NULL,49),(18,'2023-11-13 10:34:17',_binary '','2023-11-13 10:44:53',1,_binary '\0','x7',2,NULL,50),(19,'2023-11-13 10:46:41',_binary '\0','2023-11-17 09:43:23',2,_binary '\0','정경훈(9기 코치)',2,NULL,35),(20,'2023-11-13 10:46:58',_binary '\0','2023-11-13 14:35:12',1,_binary '','정경훈',2,NULL,35),(21,'2023-11-13 10:54:06',_binary '\0','2023-11-16 14:44:42',2,_binary '\0','정인모(9기 코치)',2,NULL,35),(22,'2023-11-13 10:54:23',_binary '\0','2023-11-13 12:08:19',1,_binary '','정인모',2,NULL,35),(23,'2023-11-13 11:28:00',_binary '','2023-11-13 11:43:09',1,_binary '\0','x11',2,NULL,51),(24,'2023-11-13 11:41:55',_binary '','2023-11-15 01:53:10',1,_binary '\0','권선근24 (0953083)',2,NULL,53),(25,'2023-11-13 11:58:49',_binary '\0','2023-11-13 12:30:48',1,_binary '','부울경캠퍼스',2,NULL,24),(26,'2023-11-13 14:48:43',_binary '\0','2023-11-13 14:48:43',1,_binary '','싸피',2,NULL,24),(27,'2023-11-13 14:49:09',_binary '\0','2023-11-15 15:36:12',1,_binary '\0','김승연 (0956879)',2,NULL,54),(28,'2023-11-13 15:23:55',_binary '','2023-11-13 15:29:41',1,_binary '\0','권선근 (0953083)',2,NULL,55),(29,'2023-11-13 15:31:01',_binary '\0','2023-11-15 08:52:40',1,_binary '\0','권선근 (0953083)',2,NULL,56),(30,'2023-11-13 15:49:00',_binary '','2023-11-14 12:34:54',1,_binary '\0','김승연 (0956879)',2,NULL,57),(31,'2023-11-13 16:10:16',_binary '','2023-11-13 16:11:08',1,_binary '\0','김승연 (09568799)',2,NULL,58),(32,'2023-11-13 16:17:10',_binary '','2023-11-13 16:43:07',1,_binary '\0','김승연 (09568799)',2,NULL,58),(33,'2023-11-13 16:26:07',_binary '\0','2023-11-15 14:56:48',1,_binary '\0','조현덕 (0956535)',2,NULL,46),(34,'2023-11-13 16:49:33',_binary '','2023-11-13 16:50:38',1,_binary '\0','김승연 (09568799)',2,NULL,58),(35,'2023-11-13 16:56:49',_binary '','2023-11-14 12:09:25',1,_binary '\0','김승연 (0956879)',2,NULL,58),(36,'2023-11-13 16:59:20',_binary '\0','2023-11-15 15:39:24',1,_binary '\0','김광표 (0953292)',2,NULL,41),(37,'2023-11-13 17:34:10',_binary '\0','2023-11-14 14:31:38',1,_binary '\0','싸피위키 문서작성가이드',2,NULL,56),(38,'2023-11-13 21:48:01',_binary '\0','2023-11-17 09:43:34',1,_binary '\0','호날두',2,NULL,37),(39,'2023-11-13 21:58:39',_binary '\0','2023-11-13 21:58:39',1,_binary '\0','차민준 (096704)',2,NULL,37),(40,'2023-11-14 10:47:14',_binary '\0','2023-11-14 11:22:41',1,_binary '\0','이하린 (0959156)',2,NULL,60),(41,'2023-11-14 10:49:32',_binary '\0','2023-11-14 11:31:43',1,_binary '\0','공정민 (0951513)',2,NULL,61),(42,'2023-11-14 10:52:59',_binary '\0','2023-11-14 10:56:20',1,_binary '\0','하성호 (0958227)',2,NULL,63),(43,'2023-11-14 10:57:17',_binary '\0','2023-11-14 10:57:17',1,_binary '\0','윤자현 (0954348)',2,NULL,64),(44,'2023-11-14 11:05:02',_binary '\0','2023-11-14 11:32:59',1,_binary '\0','양불회 (0950740)',2,NULL,59),(45,'2023-11-14 11:25:33',_binary '\0','2023-11-14 11:55:18',1,_binary '\0','방정우 (0952180)',2,NULL,66),(46,'2023-11-14 11:36:07',_binary '\0','2023-11-16 09:47:53',1,_binary '\0','조현덕 (0956535)/프로젝트',2,NULL,46),(47,'2023-11-14 11:41:38',_binary '\0','2023-11-16 14:50:36',2,_binary '\0','싸탈',2,NULL,38),(48,'2023-11-14 12:09:31',_binary '\0','2023-11-14 12:09:31',1,_binary '','팡표',1,NULL,24),(49,'2023-11-14 12:10:31',_binary '','2023-11-14 16:34:04',1,_binary '\0','김승연 (0956879)',2,NULL,58),(50,'2023-11-14 12:15:43',_binary '','2023-11-16 10:14:51',1,_binary '','김승연',1,NULL,58),(51,'2023-11-14 14:33:23',_binary '\0','2023-11-14 14:33:23',1,_binary '\0','권은정 (0957359)',2,NULL,72),(52,'2023-11-14 15:39:09',_binary '\0','2023-11-14 15:39:09',1,_binary '\0','박세윤 (2017707071)',2,NULL,73),(53,'2023-11-14 15:57:07',_binary '\0','2023-11-14 15:57:07',1,_binary '\0','이승민 (0950361)',2,NULL,74),(54,'2023-11-14 16:40:46',_binary '\0','2023-11-16 13:49:36',1,_binary '\0','심규렬',2,NULL,63),(55,'2023-11-14 16:55:42',_binary '','2023-11-14 17:32:58',1,_binary '\0','커피 이벤트',2,NULL,24),(56,'2023-11-14 16:55:42',_binary '\0','2023-11-14 17:43:59',2,_binary '\0','이정원 (PRO)',2,NULL,75),(57,'2023-11-14 17:35:14',_binary '','2023-11-14 17:35:49',1,_binary '\0','싸피 커피 이벤트',2,NULL,24),(58,'2023-11-14 17:38:32',_binary '\0','2023-11-14 17:38:32',1,_binary '\0','싸피커피이벤트',2,NULL,24),(59,'2023-11-14 17:52:26',_binary '\0','2023-11-16 16:31:52',1,_binary '\0','권선근',2,NULL,77),(60,'2023-11-14 17:52:48',_binary '\0','2023-11-15 00:17:27',2,_binary '\0','북두오성',2,NULL,41),(61,'2023-11-15 00:23:39',_binary '\0','2023-11-15 00:23:39',1,_binary '\0','9기',2,NULL,41),(62,'2023-11-15 11:47:25',_binary '\0','2023-11-15 11:53:43',1,_binary '\0','강다은 (0958483)',2,NULL,78),(63,'2023-11-15 11:55:36',_binary '\0','2023-11-15 11:55:36',2,_binary '\0','일타싸피',2,NULL,39),(64,'2023-11-15 11:56:09',_binary '\0','2023-11-15 11:56:09',1,_binary '\0','김지홍 (0953632)',2,NULL,79),(65,'2023-11-15 12:09:16',_binary '\0','2023-11-15 14:53:10',2,_binary '\0','싸피레이스',2,NULL,39),(66,'2023-11-15 12:33:16',_binary '\0','2023-11-15 12:33:16',2,_binary '\0','공통프로젝트',2,NULL,39),(67,'2023-11-15 12:40:48',_binary '\0','2023-11-15 12:48:47',2,_binary '\0','특화프로젝트',2,NULL,39),(68,'2023-11-15 12:48:14',_binary '\0','2023-11-15 12:48:14',2,_binary '\0','자율프로젝트',2,NULL,39),(69,'2023-11-15 14:20:38',_binary '\0','2023-11-15 14:20:38',1,_binary '\0','삼성',2,NULL,24),(70,'2023-11-15 14:22:51',_binary '\0','2023-11-15 14:22:51',1,_binary '\0','11기',2,NULL,39),(71,'2023-11-15 14:37:28',_binary '\0','2023-11-15 17:16:51',1,_binary '\0','싸피위키/문법',3,NULL,39),(72,'2023-11-15 14:39:27',_binary '\0','2023-11-15 14:39:27',1,_binary '\0','북!빠지다',2,NULL,41),(73,'2023-11-15 15:05:51',_binary '\0','2023-11-15 15:23:43',2,_binary '\0','약해지지마',2,NULL,39),(74,'2023-11-15 15:08:58',_binary '\0','2023-11-15 15:14:55',1,_binary '\0','주경야학',2,NULL,63),(75,'2023-11-15 15:10:55',_binary '\0','2023-11-15 15:10:55',1,_binary '','김광표',1,NULL,24),(76,'2023-11-15 15:13:56',_binary '\0','2023-11-15 15:16:24',2,_binary '\0','개미는오늘도',2,NULL,24),(77,'2023-11-15 15:16:12',_binary '\0','2023-11-15 15:23:36',1,_binary '\0','익명 (0000000)',2,NULL,83),(78,'2023-11-15 15:18:19',_binary '\0','2023-11-15 15:18:19',1,_binary '\0','이동주 (0957443)',2,NULL,84),(79,'2023-11-15 15:20:01',_binary '\0','2023-11-15 15:33:47',1,_binary '\0','동또농',2,NULL,79),(80,'2023-11-15 15:27:17',_binary '\0','2023-11-15 15:50:43',1,_binary '\0','스크루지',2,NULL,78),(81,'2023-11-15 15:38:50',_binary '','2023-11-15 15:49:33',1,_binary '\0','게시글 복구',2,NULL,86),(82,'2023-11-15 15:40:16',_binary '\0','2023-11-15 17:14:24',1,_binary '\0','블랙프라이데이',2,NULL,56),(83,'2023-11-15 15:40:17',_binary '\0','2023-11-15 15:40:17',1,_binary '\0','나무위키',2,NULL,24),(84,'2023-11-15 15:42:27',_binary '\0','2023-11-17 09:59:47',1,_binary '\0','이상훈',2,NULL,86),(85,'2023-11-15 16:10:58',_binary '\0','2023-11-15 16:28:05',1,_binary '\0','이상훈 (0958025)',1001,NULL,88),(86,'2023-11-16 10:13:31',_binary '','2023-11-16 10:45:47',2,_binary '\0','싸피위키:프로젝트',1002,NULL,24),(87,'2023-11-16 10:28:10',_binary '','2023-11-17 09:05:31',1,_binary '\0','신고받음',2,NULL,24),(88,'2023-11-16 10:57:43',_binary '','2023-11-17 09:04:47',2,_binary '\0','싸피위키/프로젝트',1003,NULL,46),(89,'2023-11-16 11:12:15',_binary '\0','2023-11-16 11:12:39',2,_binary '\0','프로젝트',1004,NULL,46),(90,'2023-11-16 12:23:32',_binary '\0','2023-11-16 12:23:32',1,_binary '\0','프로세스와 스레드',2,NULL,58),(91,'2023-11-16 12:30:07',_binary '\0','2023-11-16 12:30:07',1,_binary '\0','엔진엑스',2,NULL,56),(92,'2023-11-16 12:33:58',_binary '\0','2023-11-16 12:33:58',1,_binary '\0','웹서버',2,NULL,56),(93,'2023-11-16 12:36:39',_binary '\0','2023-11-16 12:36:39',1,_binary '\0','데드락',2,NULL,58),(94,'2023-11-16 12:38:48',_binary '\0','2023-11-16 12:38:48',1,_binary '\0','스프링 프레임워크',2,NULL,56),(95,'2023-11-16 14:06:53',_binary '','2023-11-16 14:42:32',1006,_binary '\0','구희영 (0959108)',1006,NULL,91),(96,'2023-11-16 14:12:05',_binary '\0','2023-11-16 14:12:05',1,_binary '\0','대학수학능력시험',2,NULL,56),(97,'2023-11-16 14:21:59',_binary '\0','2023-11-16 14:21:59',1,_binary '\0','젠킨스',2,NULL,56),(98,'2023-11-16 14:23:08',_binary '','2023-11-17 09:40:25',1,_binary '\0','LSH',2,NULL,86),(99,'2023-11-16 14:35:32',_binary '','2023-11-16 17:44:46',1007,_binary '\0','승연비밀',1007,NULL,58),(100,'2023-11-16 15:17:21',_binary '','2023-11-16 17:44:47',1008,_binary '\0','승연비밀2',1008,NULL,58),(101,'2023-11-16 15:56:04',_binary '\0','2023-11-16 15:56:04',1,_binary '\0','루비',2,NULL,46),(102,'2023-11-17 09:07:13',_binary '','2023-11-17 09:13:24',2,_binary '\0','싸피위키/프로젝트',1009,NULL,46),(103,'2023-11-17 11:31:18',_binary '\0','2023-11-17 11:32:13',1010,_binary '\0','싸피위키/프로젝트',1010,NULL,46),(104,'2023-11-17 11:42:41',_binary '\0','2023-11-17 11:42:41',2,_binary '\0','거창',2,NULL,103);
/*!40000 ALTER TABLE `documents` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-11-17 11:44:32
